app/views/home/_busqueda.html.erb


  <%=select("nombre", "@distritoID", District.all.collect {|p| [ p.no_distrito, p.district_id ] }, {prompt: 'Selecciona Distrito'}) %>
---
SELECT `districts`.* FROM `districts`