app/views/home/buscar.html.erb

  <form accept-charset="UTF-8" action="home/locales" method="get">
      <%=select("nombre", "@distritoID", District.all.collect {|p| [ p.no_distrito, p.district_id ] }, {prompt: 'Selecciona Distrito'}) %>
---
SELECT `districts`.* FROM `districts`