app/views/home/index.html.erb

SELECT `districts`.* FROM `districts`
---

                <%= select("post", "person_id", District.all.collect {|p| [ p.no_distrito, p.district_id ] }, {prompt: 'Selecciona Distrito'}) %>